#+TITLE: Advent of Code 2024
#+SUBTITLE: Day 11: Plutonian Pebbles
#+AUTHOR: Michael R. Mauger
#+DATE: [Fri Dec 13 16:15:09 EST 2024]
#+STARTUP: showeverything inlineimages
#+OPTIONS: toc:nil
#+OPTIONS: ^:{}
#+OPTIONS: num:nil

#+AUTO_TANGLE: t
#+PROPERTY: header-args    :tangle no
#+PROPERTY: header-args    :noweb no-export

** With Guile
#+BEGIN_SRC bash :results output
  guile3.0 --no-auto-compile --r7rs plutonian-pebbles.scm example.dat
  guile3.0 --no-auto-compile --r7rs plutonian-pebbles.scm input.dat
#+END_SRC

#+RESULTS:
: Part One: Plutonian Pebbles in "example.dat" (6 blinks): 22
: Part One: Plutonian Pebbles in "example.dat" (25 blinks): 55312
: Part One: Plutonian Pebbles in "input.dat" (6 blinks): 79
: Part One: Plutonian Pebbles in "input.dat" (25 blinks): 193269

** With SQLite
#+BEGIN_SRC bash :results output
  LOAD_FILE=example.dat sqlite3 < plutonian-pebbles.sql
  # LOAD_FILE=input.dat   sqlite3 < plutonian-pebbles.sql
#+END_SRC

#+RESULTS:
#+begin_example
memory
Run Time: real 0.001 user 0.000000 sys 0.000157
changes: 0   total_changes: 0
┌───────────┐
│ COUNT (*) │
├───────────┤
│ 2         │
└───────────┘
Run Time: real 0.000 user 0.000000 sys 0.000026
changes: 1   total_changes: 2
Run Time: real 0.000 user 0.000000 sys 0.000171
changes: 1   total_changes: 2
┌───────────────────────┐
│      DATETIME()       │
├───────────────────────┤
│ '2024-12-12 17:47:35' │
└───────────────────────┘
Run Time: real 0.000 user 0.000000 sys 0.000015
changes: 1   total_changes: 2
┌───────────────────────────────────────────┐
│ Part Zero: Plutonian Pebbles for 6 blinks │
├───────────────────────────────────────────┤
│ 22                                        │
└───────────────────────────────────────────┘
Run Time: real 0.002 user 0.001021 sys 0.000200
changes: 1   total_changes: 2
┌───────────────────────┐
│      DATETIME()       │
├───────────────────────┤
│ '2024-12-12 17:47:35' │
└───────────────────────┘
Run Time: real 0.000 user 0.000003 sys 0.000011
changes: 1   total_changes: 2
┌───────────────────────────────────────────┐
│ Part One: Plutonian Pebbles for 25 blinks │
├───────────────────────────────────────────┤
│ 55312                                     │
└───────────────────────────────────────────┘
Run Time: real 0.977 user 0.961181 sys 0.012832
changes: 1   total_changes: 2
┌───────────────────────┐
│      DATETIME()       │
├───────────────────────┤
│ '2024-12-12 17:47:36' │
└───────────────────────┘
Run Time: real 0.000 user 0.000027 sys 0.000000
changes: 1   total_changes: 2
┌───────────────────────────────────────────┐
│ Part Two: Plutonian Pebbles for 75 blinks │
├───────────────────────────────────────────┤
│ 0                                         │
└───────────────────────────────────────────┘
Run Time: real 10704.892 user 10308.276346 sys 316.856105
changes: 1   total_changes: 2
┌───────────────────────┐
│      DATETIME()       │
├───────────────────────┤
│ '2024-12-12 20:46:01' │
└───────────────────────┘
Run Time: real 0.000 user 0.000114 sys 0.000000
changes: 1   total_changes: 2
Memory Used:                         87016 (max 2241104) bytes
Number of Outstanding Allocations:   291 (max 772)
Number of Pcache Overflow Bytes:     16960 (max 2055088) bytes
Largest Allocation:                  87360 bytes
Largest Pcache Allocation:           4368 bytes
Lookaside Slots Used:                46 (max 123)
Successful lookaside attempts:       1411067258
Lookaside failures due to size:      9
Lookaside failures due to OOM:       370
Pager Heap Usage:                    13608 bytes
Page cache hits:                     20
Page cache misses:                   0
Page cache writes:                   0
Page cache spills:                   0
Schema Heap Usage:                   8464 bytes
Statement Heap/Lookaside Usage:      0 bytes
Bytes received by read():            148405958294
Bytes sent to write():               225532616252
Read() system calls:                 36231957
Write() system calls:                55061685
Bytes read from storage:             114823602176
Bytes written to storage:            225034371072
Cancelled write bytes:               259067904
#+end_example
